/**
 * @file       user_config.h
 * @author     魏佳宝 (weijiabao@stw-ecig.cn)
 * @date       2025-01-11
 * @brief      简单描述改文件的功能
 * @version    v1.0
 *
 * ************************************************************************
 * @attention
 * 变更记录     版本号       作者       变更日期       变更内容
 *
 * ************************************************************************
 * 版权所有 © 深圳思拓微电子有限公司。保留所有权利。
 * ************************************************************************
 */
#if 1  // 全局宏开关

#ifndef __USER_CONFIG_H
#define __USER_CONFIG_H

#ifdef __cplusplus
extern "C"
{
#endif

/* 头文件包含 *************************************************************************/
#include <stdbool.h>
/* 全局宏定义 *************************************************************************/

#define POWERON_DELAY_ENABLE (0)
#define POWERON_DELAY_TIME   (100)

#define DELAY_VALUE_RESULT  (1)
#define Q_VALUE_BUFFER_SIZE (10)

#define MODE_SUM 6
#define MODE_NULL MODE_SUM-1
#define CURRENT_SUM 3	
#define SEQ_IDLE (0xFF)
#define CH_SUM   (3)


#define SEQ_MAX (SEQ_SUM - 1)
#define ALLOW_CALIB         (1)  // 按钮零点校准和参考校准  1:允许 0:不允许 （禁用是为了防止产线使用过程中误触）
#define ALLOW_MANNUAL_CALIB (1)  // 手动校准 1:允许 0:不允许

/* 全局宏函数定义 *********************************************************************/

/* 全局类型定义 ***********************************************************************/

/* 全局变量声明 ***********************************************************************/


/* 全局函数声明 ***********************************************************************/

#ifdef __cplusplus
}
#endif

#endif /* __USER_CONFIG_H */

#endif
/* ************************************* 文件结束 *************************************/
